In [2]:
import pandas as pd
df = pd.read_csv("titanic_dataset.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId', 'Name', 'SibSp','Parch'	,'Ticket','Cabin','Embarked'], axis ='columns', inplace = True)

In [4]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [6]:
dummies = pd.get_dummies(inputs.Sex)   # one hot encoding
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs, dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop('Sex', axis = 'columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [9]:
# find any na values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1

In [21]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs,target, test_size=0.2)

In [22]:
len(x_train)

712

In [23]:
len(x_test)

179

In [24]:
len(inputs)

891

In [25]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [26]:
model.fit(x_train, y_train)

GaussianNB()

In [27]:
model.score(x_test,y_test)

0.8324022346368715

In [28]:
x_test[:10]

     Pclass        Age      Fare  female  male
682       3  20.000000    9.2250       0     1
884       3  25.000000    7.0500       0     1
424       3  18.000000   20.2125       0     1
375       1  29.699118   82.1708       1     0
534       3  30.000000    8.6625       1     0
760       3  29.699118   14.5000       0     1
609       1  40.000000  153.4625       1     0
220       3  16.000000    8.0500       0     1
192       3  19.000000    7.8542       1     0
241       3  29.699118   15.5000       1     0

In [29]:
y_test[:10]

/tmp/ipykernel_5210/2588316582.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[:10]

682    0
884    0
424    0
375    1
534    0
760    0
609    1
220    1
192    1
241    1
Name: Survived, dtype: int64

In [30]:
model.predict(x_test[:10])

array([0, 0, 0, 1, 1, 0, 1, 0, 1, 1])

In [31]:
model.predict_proba(x_test[:10])

array([[9.87207587e-01, 1.27924126e-02],
       [9.88088410e-01, 1.19115902e-02],
       [9.86621899e-01, 1.33781012e-02],
       [2.71409095e-03, 9.97285909e-01],
       [8.88185742e-02, 9.11181426e-01],
       [9.88860015e-01, 1.11399853e-02],
       [2.22277934e-05, 9.99977772e-01],
       [9.86071021e-01, 1.39289794e-02],
       [7.68512164e-02, 9.23148784e-01],
       [8.92476257e-02, 9.10752374e-01]])